In [21]:
import pandas as pd

# Örnek bir DataFrame oluşturma
data = {
    'İsim': ['Ali', 'Veli', 'Ayşe', 'Fatma'],
    'Yaş': [23, 25, 22, 24],
    'Şehir': ['İstanbul', 'Ankara', 'İzmir', 'Bursa']
}

df = pd.DataFrame(data)

In [19]:
df.tail(2)

    İsim  Yaş  Şehir
2   Ayşe   22  İzmir
3  Fatma   24  Bursa

In [23]:
df.head(3)

   İsim  Yaş     Şehir
0   Ali   23  İstanbul
1  Veli   25    Ankara
2  Ayşe   22     İzmir

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   İsim    4 non-null      object
 1   Yaş     4 non-null      int64
 2   Şehir   4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [27]:
# describe() fonksiyonu, sayısal verilerin özet istatistiklerini döndürür.
df.describe()

             Yaş
count   4.000000
mean   23.500000
std     1.290994
min    22.000000
25%    22.750000
50%    23.500000
75%    24.250000
max    25.000000

In [31]:
df.drop('Yaş', axis=1)

    İsim     Şehir
0    Ali  İstanbul
1   Veli    Ankara
2   Ayşe     İzmir
3  Fatma     Bursa

In [33]:
df.isnull()

    İsim    Yaş  Şehir
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [35]:
df.sort_values(by='Yaş')

    İsim  Yaş     Şehir
2   Ayşe   22     İzmir
0    Ali   23  İstanbul
3  Fatma   24     Bursa
1   Veli   25    Ankara

In [37]:
# value_counts() fonksiyonu, bir sütundaki benzersiz değerlerin sıklığını sayar.
df['Şehir'].value_counts()

Şehir
İstanbul    1
Ankara      1
İzmir       1
Bursa       1
Name: count, dtype: int64

In [41]:
df['Yaş'].apply(lambda x: x * 2)

0    46
1    50
2    44
3    48
Name: Yaş, dtype: int64

In [43]:
df['Yaş'].astype(str)

0    23
1    25
2    22
3    24
Name: Yaş, dtype: object